app/Controllers/AuthController.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '104'
---
    public function perfil()
    {
        if (!$this->session->get('isLoggedIn')) {
            return redirect()->to(site_url('login'))->with('info', 'Debes iniciar sesión para ver tu perfil.');
        }

        $loggedInUserId = $this->session->get('user_id');
        $usuario = $this->usuarioModel->find($loggedInUserId);