app/Controllers/Home.php

SELECT *
FROM `tareas`
WHERE `id` = '104'
AND `fecha_recordatorio` IS NOT NULL
AND `fecha_recordatorio` != '0000-00-00'
AND `fecha_recordatorio` <= '2025-05-18'
AND `estado` != 'completada'
---

        if (!$this->session->has('recordatorio_mostrado')) {

            $recordatorios = $this->tareaModel
                ->where('id', $loggedInUserId)
                ->where('fecha_recordatorio IS NOT NULL')
                ->where('fecha_recordatorio !=', '0000-00-00')
                ->where('fecha_recordatorio <=', date('Y-m-d'))
                ->where('estado !=', 'completada')
                ->findAll();