app/Controllers/Tareas.php

             'archivada'       => 0,
         ];

         if ($this->tareaModel->insert($data)) {
---
INSERT INTO `tareas` (`asunto`, `descripcion`, `prioridad`, `fecha_vencimiento`, `id_usuario`, `estado`, `color`, `archivada`) VALUES ('FAJL', 'AG', 'normal', '', '105', 'definida', '#a5dff9', 0)

    public function storeSubtarea()
    {
        $subtareaModel = new SubtareaModel();

        $validationRules = [
            'id_tarea' => 'required|is_natural_no_zero',
            'descripcion' => 'required|string|min_length[3]',
            'prioridad' => 'required|in_list[baja,normal,alta]',
            'fecha_vencimiento' => 'permit_empty|valid_date'
        ];

        if (!$this->validate($validationRules)) {
            session()->setFlashdata('mensaje', 'Error en los datos de la subtarea.');
            return redirect()->back()->withInput();
        }

        $data = [
            'id_tarea' => $this->request->getPost('id_tarea'),
            'descripcion' => $this->request->getPost('descripcion'),
            'prioridad' => $this->request->getPost('prioridad'),
            'fecha_vencimiento' => $this->request->getPost('fecha_vencimiento'),
            'estado' => 'definida',
            'comentario' => NULL
        ];

        if ($subtareaModel->insert($data)) {
---
INSERT INTO `subtareas` (`id_tarea`, `descripcion`, `prioridad`, `fecha_vencimiento`, `estado`, `comentario`) VALUES ('110', 'askg', 'normal', '', 'definida', NULL)