app/Models/ColaboracionModel.php

SELECT *
FROM `tareas`
WHERE `tareas`.`id` = '104'
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '105'
---
    public function getTareasCompartidasConUsuario(int $idColaborador): array
    {
        $colaboraciones = $this->where('id_colaborador', $idColaborador)
                               ->orderBy('id_tarea', 'ASC')
                               ->orderBy('id_subtarea', 'ASC NULLS LAST')
                               ->findAll();

        if (empty($colaboraciones)) {
            return [];
        }

        $tareasCompartidas = [];
        $subtareaModel = new SubtareaModel();
        $tareaModel = new TareaModel();
        $usuarioModel = new UsuarioModel();

        foreach ($colaboraciones as $colaboracion) {
            $idTarea = $colaboracion['id_tarea'];

            if (!isset($tareasCompartidas[$idTarea])) {
                $detalleTarea = $tareaModel->find($idTarea);
                if ($detalleTarea) {
                    $creador = $usuarioModel->find($detalleTarea['id_usuario']);

SELECT *
FROM `subtareas`
WHERE `subtareas`.`id` = '141'
---
            }

            if ($colaboracion['id_subtarea'] !== null && isset($tareasCompartidas[$idTarea])) {
                $detalleSubtarea = $subtareaModel->find($colaboracion['id_subtarea']);