app/Models/SubtareaModel.php

SELECT *
FROM `subtareas`
WHERE `id_tarea` = 105
ORDER BY `id` ASC
---
    public function getSubtareasByTareaId(int $tareaId)
    {
        return $this->where('id_tarea', $tareaId)
                    ->orderBy('id', 'ASC')
                    ->findAll();