app/Models/TareaModel.php

    public function getArchivedTareasByUserId(int $userId)
    {
        return $this->where('id_usuario', $userId)
                    ->where('estado', 'completada')
---
SELECT *
FROM `tareas`
WHERE `id_usuario` = 105
AND `estado` = 'completada'

    public function getTareasByUserId(int $userId)
    {
        return $this->where('id_usuario', $userId)
                    ->where('estado !=', 'completada')
---
SELECT *
FROM `tareas`
WHERE `id_usuario` = 104
AND `estado` != 'completada'