app/Models/UsuarioModel.php

    public function getUsuarios()
    {
        return $this->findAll();
---
SELECT *
FROM `usuarios`

    public function getUserByEmail(string $email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'g@gmail.com'
 LIMIT 1